[
    {
        "image": "/img/fellows/jarrett_lewis.png",
        "url": "jtlewis",
        "header": "Jarrett Lewis",
        "subheader": "assistant professor in the Department of Educational Psychology, is leading a collaboration among Champaign Unit 4 School District administrators and mental health practitioners, the College of Education’s Counseling Psychology program, the Department of Psychology’s Clinical-Community Psychology program, and the Master of Social Work program to address mental health disparities faced by Black middle school youth."
    },
    {
        "image": "/img/fellows/sam_lindgren.png",
        "url": "salindgr",
        "header": "Samantha Lindgren",
        "subheader": "assistant professor in the Department of Education Policy, Organization & Leadership, is working with the Environmental Education Association of Illinois to conduct a needs assessment of non-formal environmental education providers (such as forest preserves, nature centers, and botanical gardens) to help effectively reach diverse audiences."
    },
    {
        "image": "/img/fellows/cherie_avent.png",
        "url": "cmavent",
        "header": "Cherie Avent",
        "subheader": "assistant professor in the Department of Educational Psychology, is partnering with local African American churches to address challenges related to COVID-19. “More specifically, designing, implementing, and evaluating community initiated COVID-19 interventions, such as vaccine clinics, messaging campaigns, town halls, etc., that are grounded in culturally sustaining research and culturally responsive evaluation,” she says."
    },
    {
        "image": "/img/fellows/erica_mason.png",
        "url": "enmason",
        "header": "Erica Mason",
        "subheader": "assistant professor in the Department of Special Education, is heading a partnership with teachers to improve math instruction for students with disabilities. The goal, says Mason, is to support mathematics teachers in adopting a more humanizing stance about who is mathematically capable and how mathematics instruction  can reflect such a stance."
    }
]
