[
    {
        "image": "/img/new_faculty/elizabeth_dyer.png",
        "username": "edyer",
        "header": "Elizabeth Dyer",
        "subheader": "Assistant Professor, Curriculum & Instruction",
        "text": "Dyer completed her Ph.D. in Learning Sciences at Northwestern University and a B.A. degree in Astrophysics and Mathematics from the University of California, Berkeley.",
        "quote": "My work focuses on educators’ professional learning in K-12 mathematics, science, and STEM contexts. I use a learning sciences perspective to investigate the reasoning, sensemaking, and processes used by educators as they transform and reimagine their practice. This involves using a variety of research methodologies, including qualitative, quantitative, and computational methods, and relies heavily on video data from classrooms and professional learning experiences."
    },
    {
        "image": "/img/new_faculty/stephanie_toliver.png",
        "username": "stoliver",
        "header": "Stephanie Toliver",
        "subheader": "Assistant Professor, Curriculum & Instruction",
        "text": "Toliver completed her Ph.D. in Language and Literacy Education and a graduate certificate in Diversity, Equity, and Inclusion from the University of Georgia. Prior to that, she completed an M.S. in Curriculum and Instruction after earning a B.A. in English Education—both from Florida Agricultural and Mechanical University (FAMU), an HBCU in Tallahassee, Florida.",
        "quote": "My scholarship is centered in the examination of how Black youth engage in the reading and writing of speculative fiction to discuss and challenge their experiences with social injustice; the consideration of how intersecting oppressions infiltrate the field of education and how educators must use their imaginations to dream of ways to challenge injustice in schools; and the demonstration of how Black people use speculative storytelling to metaphorically describe modern and historical antiblackness and to dream of worlds and futures in which Black people are free from the burdens of societal injustice."
    },
    {
        "image": "/img/new_faculty/stacy_bennett.png",
        "username": "bennetts",
        "header": "Stacy Bennett",
        "subheader": "Teaching Assistant Professor, Education Policy, Organization & Leadership",
        "text": "Bennett is an Illinois alumna, completing her Ph.D. in Education Policy, Organization & Leadership focused on Higher Education Policy. Previously, she earned a Master of Public Policy (MPP) from the University of Chicago and a B.S. in Political Science, Geography, and Environmental Science from Kansas State University.",
        "quote": "Professionally, I have focused on public policy, political campaigns, and grassroots advocacy through working with organizations, candidates, and elected officials at the national, state, and local levels. Prior to this, I worked in undergraduate admissions at the UIUC Gies College of Business and was an independent consultant working on a variety of education projects including grant evaluation, public awareness, and admissions consulting."
    },
    {
        "image": "/img/new_faculty/vania_castro.png",
        "username": "vaniac",
        "header": "Vânia Castro",
        "subheader": "Teaching Assistant Professor, Education Policy, Organization & Leadership",
        "text": "Castro completed her Ph.D. in Applied Linguistics at the Federal University of Minas Gerais (UFMG), Brazil, in May 2021.",
        "quote": "I held the Werner Baer Postdoctoral Fellow position at the Lemann Center for Brazilian Studies at the University of Illinois Urbana-Champaign from 2022 to 2023. Additionally, I was a visiting scholar with the CAPES/PrInt program at UIUC in 2019 and 2020, where I developed part of my doctoral study. My investigation centered on leveraging mobile devices to provide support to educators and students in underserved regions of Brazil. My current research interests include emerging technologies in education, mobile learning, multiliteracies, teacher education, and artificial intelligence."
    },
    {
        "image": "/img/new_faculty/kimberly_ransom.png",
        "username": "kransom",
        "header": "Kimberly Ransom",
        "subheader": "Assistant Professor, Education Policy, Organization & Leadership",
        "text": "Ransom completed her Ph.D. in Educational Studies from the University of Michigan, her M.A. from DePaul University, and her B.S. from Bradley University.",
        "quote": "I am an interdisciplinary historian studying the history of African American education and childhood. My research examines the oral histories and material objects of Black children who once attended segregated schools in the Deep South during the Jim Crow Era (1940-1969). As a public scholar and artist, I use historical research to create public exhibits related to African American childhood in and around schools, seeking to illuminate the unique ways Black children have been marginalized from childhood status in America."
    },
    {
        "image": "/img/new_faculty/kaylin_ratner.png",
        "username": "kratner",
        "header": "Kaylin Ratner",
        "subheader": "Assistant Professor, Educational Psychology",
        "text": "Kaylin Ratner received a Ph.D. in Developmental Psychology from Cornell University with concentrations in Social and Personality Development, Developmental Psychopathology, and Applied Statistics. She earned a M.A. (Clinical Psychology) and B.S. (Psychology, honors) degrees from the University of Central Florida. Ratner studies how adolescents and young adults reconcile their senses of identity, purpose, and meaning in life, and how these psychosocial processes interface with mental health.",
        "quote": ""
    },
    {
        "image": "/img/new_faculty/michele_schutz.png",
        "username": "maschutz",
        "header": "Michele Schutz",
        "subheader": "Assistant Professor, Special Education",
        "text": "Michele Schutz earned her Ph.D. in Special Education from Vanderbilt University. She earned her bachelor’s degree in Special Education from Illinois State University and her master’s degree in Multiple Disabilities and Secondary Transition from the University of Illinois Chicago. Schutz’s research interests center on the transition of youth with significant disabilities from high school to adult outcomes, especially meaningful employment. support needs to work experiences, particularly in rural communities. She is particularly interested in the roles that various school staff play in facilitating career development for students with disabilities, particularly in rural communities.",
        "quote": ""
    }
]
