[
    {
    "image": "/img/research-recognition/stacy-dymond.png",
    "username": "sdymond",
    "doubleimage": false,
    "header": "Stacy Dymond",
    "text": "professor in Special Education and David Strauser (Community Health) established the Center on Transition and Work. The Center offers state-wide training and technical assistance to school personnel, rehabilitation counselors, and families to improve post-school employment outcomes for students with significant disabilities. Funded by the Illinois State Board of Education, this 5-year, $5 million-dollar project is a collaboration between the College of Education and the College of Applied Heath Sciences. Dymond, Strauser, and John Kosciulek (Community Health) were also awarded a Vocational Training Grant. This 5-year, $1.5 million-dollar project funded by the Illinois Department of Human Services and Division of Vocational Rehabilitation will provide statewide training to vocational rehabilitation counselors who prepare individuals with disabilities for employment."
    },
    {
    "image": "/img/research-recognition/meghan-burke.png",
    "username": "meghanbm",
    "doubleimage": false,
    "header": "Meghan Burke",
    "text": "associate professor in Special Education, is the faculty mentor for the Community-Academic Scholars project “Addressing Social Inequity in Early Intervention Services for Young Children with Disabilities.” In Illinois, over 20,000 young (aged 0-3) children with delays and/or disabilities receive early intervention services (e.g., speech therapy, physical therapy). These services are critical to their development and long-term functioning. Prior to COVID-19, EI services were provided in person. With COVID-19, Illinois pivoted to offer EI services via telehealth. However, this introduced inequity as families without access to technology and/or consistent internet could not access EI via telehealth. To address this inequity, the Early Intervention Clearinghouse (which is housed at University of Illinois Urbana- Champaign) received a grant to provide technology and data plans to families of young children with disabilities so they can access EI. The Community-Academic Scholars works with the Clearinghouse, Family Matters, and Dr. Burke to conduct qualitative and quantitative research about the technology loan program to determine if the program closes inequities."
    },
    {
    "image": "/img/research-recognition/eboni-zamani-gallaher.png",
    "username": "ezamanig",
    "doubleimage": false,
    "header": "Eboni Zamani-Gallaher",
    "text": "professor in Education Policy, Organization & Leadership and director of the Office of Community College Research and Leadership is building out networks for shaping the community college landscape nationwide to more widely disseminate best practices, especially those that enhance equitable access to higher education for underserved students, changing the higher education landscape across the US. OCCRL has received funding from the National Science Foundation, The Council for the Study of Community Colleges, Lumina Foundation, and Gates Foundation."
    },
    {
    "image": "/img/research-recognition/nidia-ruedas-gracia.png",
    "username": "nrgracia",
    "doubleimage": true,
    "header": "Nidia Ruedas-Gracia",
    "text": "assistant professor in Educational Psychology leads the Racial Ethnic Cultural Belonging and Belonging Vigilance study. This project seeks to provide a scholarly understanding of Racial Ethnic Cultural (REC) Belonging and Belonging Vigilance. Using focus group, interview, and survey data, Ruedas-Garcia hopes to develop a theoretical framework and testable measure that can be valid and reliable among diverse REC groups. Collaborators: Helen Neville, professor in Educational Psychology, Andi Lee, and Amir Maghsoodi."
    },
    {
    "image": "/img/research-recognition/chris-napolitano.png",
    "username": "cmn",
    "doubleimage": false,
    "header": "Chris Napolitano",
    "text": "assistant professor in Educational Psychology and recent Spitze-Mather Award winner, has strengthened his collaboration with the World Bank. Their collaboration investigates effective interventions to promote thriving among young people around the globe. Overall, their collaborative work explores how the beliefs and skills of youth can be harnessed promote their well-being. Specifically, one project examines whether youth aspirations and expectations for their future predict academic performance and employment outcomes among Basotho, Indonesian, Moldovan, Macedonian, Sudanese, Turkish Cypriot, UK and US youth. Their results will direct future large-scale interventions facilitated by the World Bank."
    },
    {
    "image": "/img/research-recognition/james-anderson.png",
    "username": "janders",
    "doubleimage": false,
    "header": "James Anderson",
    "text": "dean of the College of Education, was elected to the American Academy of Arts and Sciences, one of the oldest honor societies in the nation. He was sworn into the Board of Trustees at Stillman College in Tuscaloosa, Alabama, and inducted into the Stillman College Educator Hall of Fame—both in 2020. He is recognized as a groundbreaking scholar on the history of U.S. and African American education and achievement. His seminal book, “The Education of Blacks in the South, 1860-1935,” won the American Educational Research Association’s outstanding book award in 1990. He also received the AERA’s highest honor, a Presidential Citation, in 2020. A member of the National Academy of Education and the former senior editor of the journal History of Education Quarterly, Anderson served as an expert witness in a series of federal desegregation and affirmative action cases. He also was an adviser for and participant in several PBS documentaries, including “The Rise and Fall of Jim Crow” and “Tell Them We Are Rising: The Story of Black Colleges and Universities.” During his distinguished 47- year career at Illinois, Anderson has served in a variety of leadership roles and received several of its highest honors including selection as a Presidential Fellow, a Center for Advanced Study Professor of Education and the Edward William and Jane Marr Gutgsell Professor of Education."
    },
    {
    "image": "/img/research-recognition/malaika-mckee.png",
    "username": "malaika",
    "doubleimage": false,
    "header": "Malaika McKee",
    "text": "assistant professor in Education Policy, Organization & Leadership, received a campus Excellence in Public Engagement Faculty & Staff Team Award for excellence in public engagement for the Hip Hop Xpress Double Dutch Boom Bus. The Hip-Hop Xpress: Double Dutch Boom Bus is a mobile classroom, sound studio, venue to collect and share the history of Hip-Hop culture, and platform for innovation and entrepreneurship modeled after George Washington Carver’s Jesup Wagon."
    },
    {
    "image": "/img/research-recognition/rodney-hopson.png",
    "username": "",
    "doubleimage": true,
    "header": "Rodney Hopson and Jessica Li",
    "text": "College faculty have been involved as experts in the development of the Discovery Partners Institute (DPI) in Chicago since its inception. In 2021, Rodney Hopson, professor, Quantitative and Evaluative Research Methodologies and Robb Lindgren, professor in Curriculum & Instruction have been named to the Executive Board of the Discovery Partners Institute, a flagship initiative for the State of Illinois. Jessica Li, professor, Education Policy, Organization & Leadership has led the DPI Education and Workforce Development Task Force since 2019. As part of the I-STECS initiative, Program Coordinator Raya Hegeman-Davis, school university research coordinator, Bureau of Educational Research, has partnered with DPI staff in Summers 2020 and 2021 to deliver professional development for K-12 teachers on teaching computer science."
    },
    {
    "image": "/img/research-recognition/robb-lindgren.png",
    "username": "robblind",
    "doubleimage": true,
    "header": "Robb Lindgren",
    "text": "associate professor, Curriculum & Instruction, took his research on embodied learning simulations into museums so young science center visitors can use the full movement of their bodies to interact with a game about energy. The game, called energIze uses the Microsoft Kinect to empower children to act out different forms of energy, energy transfer, and to reason about conservation of energy. Lindgren and Mike Tissenbaum, assistant professor, Educational Psychology, are currently working with the Lawrence Hall of Science in Berkeley, CA, where the energIze exhibit is currently active on the museum floor, to develop a system of connected embodied learning exhibits that build off of each other and facilitate learning transfer."
    },
    {
    "image": "/img/research-recognition/justin-kern.png",
    "username": "kern4",
    "doubleimage": false,
    "header": "Justin Kern",
    "text": "assistant professor, Quantitative and Evaluative Research Methodologies, received the Outstanding Reviewer Award for the Journal of Educational and Behavioral Statistics and was named a Chan Zuckerberg Initiative Faculty Mentor Fellow in Educational Measurement. This program has been developed in partnership with NCME to provide mentorship support for Black, Brown, and Indigenous doctoral students interested in the field of educational measurement/psychometrics."
    },
    {
    "image": "/img/research-recognition/barbara-hug.png",
    "username": "bhug",
    "doubleimage": false,
    "header": "Barbara Hug",
    "text": "teaching associate professor in Curriculum & Instruction is part of the team for a new NSF Center, GEMS. The NSF awarded this five-year, $12.5 million grant with the aim of integrating biology to an interdisciplinary team based in the Carl R. Woese Institute for Genomic Biology at the University of Illinois Urbana-Champaign. The researchers in GEMS are collaborative, diverse, interactive scientists and educators who take an inter-disciplinary approach to answer critical questions about how nested genomes interact and affect the world."
    }
   ]
